Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: རྣམ་པར་བཀྲ་བ། མིག་ཏུ་སྡུག་པ། འཁོར་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་ཀུན་ནས་འོད་དང་ལྡན་པ་ཀུན་ནས་ཤིན་ཏུ་ཡིད་དུ་འོང་བའི་དྲི་དང་ལྡན་པའི་མེ་ཏོག་དེ་འདྲ་བ་དག་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་སྟེམེ་ཏོག་གི་ཆར་དེས་རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་སུ་མི་བདུན་གྱི་འཕང་ཙམ་གྱི་མེ་ཏོག་དགྲམ་པ་བཀྲམ་པར་གྱུར་ཏོ། །
en: The flowers were brilliant, beautiful, luminous, and had the most incredibly pleasing aroma, satisfying the entire assembly. The rain of flowers filled the jeweled pavilion to the depth of seven body lengths.

source: རབ་ཏུ་དབེན་པའི་བསམ་གཏན་གྱི་ཟས་ཞེས་བྱ་བའི་སིལ་སྙན་ཡང་བསྒྲགས་ཏེ། སིལ་སྙན་གྱི་སྒྲ་དེས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་བསམ་གཏན་ལ་སྙོམས་པར་ཞུགས་པ་བཞིན་དུ་བདག་བདེ་བས་ཚིམ་པར་ཤེས་སོ། །
en: The cymbals called “sustenance of isolated concentration” also resounded, causing the entire assembly to experience a satisfying bliss while resting in concentration.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་འདི་ལྟ་བུ་འདི་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་བདུན་བསྐོར་བ་བྱས་ནས།
en: Once the bodhisattva great being Sāgaramati had venerated the Blessed One in this way, he bowed his head to the feet of the Blessed One and circumambulated him seven times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་འདུག་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Joining his palms before the Blessed One, he expressed well-wishes to the Blessed One, saying,

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོའི་མཆོག་མངའ་བའི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་འཕགས་པའི་མངོན་པར་མཁྱེན་པ་བཅོམ་ལྡན་འདས་ལ་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་སྙུན་གསོལ་ཏོ། །
en: “Blessed One, the Thus-Gone Master of the Ocean with Noble and Playful Super-knowledge hopes that you are healthy, and that you are experiencing no adversity, intimidation, or agitation, and that you are strong and happy.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Then, the other bodhisattva great beings as well bowed their heads to the feet of the Blessed One.

source: ལན་བདུན་བསྐོར་བ་བྱས་ནས་སླར་རང་རང་གི་སྟན་ལ་འཁོད་དོ། །
en: After circumambulating him seven times they returned to their seats.

source: དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་ཚངས་པ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པ་ཞེས་བྱ་བ་མྱ་ངན་མེད་པའི་གླིང་བཞི་པ་ཆེན་པོ་ན་གནས་པ།
en: At that point, the Brahmā of the trichiliocosm, known as Great Compassionate One, was residing in the Brahmā world, a peaceful place free from any trouble.

source: ཚངས་པའི་འཇིག་རྟེན་ན་འདུག་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཆུས་ཡོངས་སུ་གང་བའི་རྒྱ་མཚོ་གཅིག་ལྟ་བུ་ཡང་མཐོང་། པད་མ་རྣམ་པར་བཀྲ་བ། བལྟ་ན་སྡུག་པ། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་མངོན་པར་བྱུང་བ་ཡང་མཐོང་། རིན་པོ་ཆེ་བཀོད་པ་འཁོར་གྱི་ཁྱམས་བྱང་ཆུབ་སེམས་དཔས་གང་བ་ཡང་མཐོང་སྟེ།
en: From there he saw the worlds of the trichiliocosm being filled with water like a single ocean, the manifestation of the trillions of brilliant and pleasing lotuses, and the jeweled pavilion filled with bodhisattvas.

source: མཐོང་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Seeing this, he pondered,

source: བསྲེག་པའི་བསྐལ་པ་ནི་མ་བྱུང་ན་ཆུས་འཇིག་པ་འདི་བྱུང་སྟེ།
en: “The eon of burning has not yet occurred, yet this flood has manifested.

source: འདི་ལྟ་བུའི་ཆོ་འཕྲུལ་འདི་དག་ཀུན་ཏུ་སྣང་བ་འདི་ལ་རྒྱུ་ཅི་ཡོད།
en: What could have caused the appearance of this magical display?

source: བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སོང་སྟེ། བཅོམ་ལྡན་འདས་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་ཆེན་པོ་འཇིག་རྟེན་དུ་བྱུང་བའི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས་ཞེས་ཞུའོ་སྙམ་མོ། །
en: I think I will go before the Blessed One and ask him what the cause and condition of these incredible and miraculous appearances in the world could be.”

source: དེ་ནས་ཚངས་པ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པ། ཚངས་པ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱིས་ཡོངས་སུ་བསྐོར་ཏེ། མདུན་དུ་བདར་ནས་ལྷན་ཅིག་ཏུ་ཚངས་པའི་འཇིག་རྟེན་ནས་མི་སྣང་བར་གྱུར་ཏེ། རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སྟེང་གི་བར་སྣང་ལ་འདུག་སྟེ། ལུས་བཏུད་ཐལ་མོ་སྦྱར་ནས།
en: Accordingly, Brahmā Great Compassionate One disappeared from the Brahmā realm, accompanied by a host of 6,800,000 Brahmā gods, and instantly appeared in the sky before the Blessed One in the jeweled pavilion.

source: བཅོམ་ལྡན་འདས་ཉིད་ལ་ཕྱག་འཚལ་ཏོ། །
en: He bowed with joined palms and prostrated to the Blessed One.

source: འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then he asked,

source: བཅོམ་ལྡན་འདས་འདི་ཅི་ལགས།
en: “Blessed One, what is happening?

source: གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཆབ་ཀྱིས་ཡོངས་སུ་གཏམས་པའི་རྒྱ་མཚོ་གཅིག་ལྟ་བུར་ཀུན་ཏུ་གདའ་བ་དང་། པད་མ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་འདི་སྙེད་ཅིག་བྱུང་བ་འདི་དང་། དེ་དག་ལ་ཡང་སྐྱེས་བུ་དམ་པ་དག་མཆིས་པ་འདི་ལྟ་བུ་ཀུན་ཏུ་གདའ་
en: The worlds of the trichiliocosm are filled with water like an ocean, and trillions of lotuses are floating here and there with sublime beings seated on each of them.

source: ཡང་བཅོམ་ལྡན་འདས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་ལ་ཡང་སྒྲིབ་པ་མ་མཆིས་པར་ཀུན་ཏུ་གདའ་བ་དང་།
en: Yet, Blessed One, still all the villages, cities, towns, lands, regions, and palaces can be seen clearly.

source: འཛམ་བུའི་གླིང་རྣམས་དང་། གླིང་བཞི་པ་ཆེན་པོ་རྣམས་དང་། རྒྱ་མཚོ་རྣམས་དང་། རི་རབ་རྣམས་དང་། འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ལ་ཡང་སྔོན་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན་དུ་སྒྲིབ་པ་ཅི་ཡང་མ་མཆིས་པར་དེ་ཁོ་ན་བཞིན་དུ་ཀུན་ཏུ་གདའ་བ་དེ་ལ།
en: Additionally, all the Jambudvīpas, four-continent worlds, oceans, Mount Merus, and gods of the desire realm are clearly visible, just as they normally are.

source: བཅོམ་ལྡན་འདས་འདི་སུའི་བྱིན་གྱི་རླབས་ཀྱིས་གྱུར་སྙམ་དུ་བདག་ངོ་མཚར་ཆེར་གྱུར་ན་
en: Blessed One, I am wondering whose blessings this represents? I am amazed.

source: འདི་སུའི་སྔ་ལྟས་ལགས།
en: Whose omen is this?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚངས་པ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered Brahmā Great Compassionate One, saying,

source: ཚངས་པ་འདི་ནི་བཅོམ་ལྡན་འདས། དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་མཆོག་མངའ་བའི་བློས་རྣམ་པར་རོལ་པ་མངོན་པར་འཕགས་པའི་མངོན་པར་མཁྱེན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་རིན་པོ་ཆེ་དྲི་མ་དང་བྲལ་བ་དཔག་ཏུ་མེད་པ་བཀོད་པས་བརྒྱན་པ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བགྲང་བ་ལས་འདས་པ་དག་དང་ལྷན་ཅིག་ཏུ་ང་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་གཏམ་གྱི་རྒྱུད་འགའ་ཞིག་ཡོངས་སུ་དྲི་བའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་འོང་བ་ཡིན་ཏེ
en: “Brahmā, the bodhisattva great being Sāgaramati and countless other bodhisattva great beings have arrived from the blessed thus-gone Master of the Ocean with Noble and Playful Super-knowledge’s buddha realm Adorned with Immaculate and Countless Precious Qualities here to the Sahā world to behold, venerate, and honor me, and to ask questions about the present Dharma teaching, which is a section of the Great Compilation .

source: གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཆུས་ཡོངས་སུ་གང་བར་ཀུན་ཏུ་སྣང་བ་འདི་ལྟ་བུ་འདི་ནི་དེའི་རྣམ་པར་སྤྲུལ་པའི་བྱིན་གྱིས་རླབས་སོ། །
en: The fact that the worlds of the trichiliocosm appear to be filled with water like an ocean is the manifestation of his blessings.”

source: བཅོམ་ལྡན་འདས་ད་དུང་ཡང་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འཆང་ངམ།
en: “Blessed One, is that Dharma teaching, which is a section of the Great Compilation , still being taught?”

source: ཚངས་པ་དེ་བཞིན་གཤེགས་པའི་སྤོབས་པ་ལ་ནི། རྒྱུན་ཆད་པ་ཆུང་ཟད་ཀྱང་མེད་དེ
en: “Brahmā, the Thus-Gone One’s eloquence is without any interruption.

source: གང་གི་ཚེ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཅང་མི་གསུང་བར་གྱུར་པ་མཐོང་བ་དེའི་ཚེ་ན་ཡང་། ད་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་རྣམ་པར་ངེས་པའི་གཏམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ
en: Even when you perceive that the Blessed One is not saying anything, I am still authentically delivering Dharma teachings to bodhisattvas gathered from throughout the worlds of the ten directions.

source: ཚངས་པ་སངས་རྒྱས་ཀྱི་ཡུལ་ནི་དེ་ལྟར་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Brahmā, the Buddha’s domain is as unfathomable as this.”

source: བཅོམ་ལྡན་འདས་གང་འདི་ལྟ་བུ་འདི་རྣམ་པར་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བགྱི་བ་དེ་གང་ལགས།
en: “Blessed One, which one is this emanated bodhisattva great being called Sāgaramati?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚངས་པ་ཁྱོད་ཀྱིས་པད་མ་དཔག་ཚད་བཅུའི་ཁྱོན་ཙམ་ཡོད་པ་དེའི་དཀྱིལ་ན་པད་མའི་སྙིང་པོ་ལ་རིན་པོ་ཆེ་བཀོད་པའི་སེང་གེའི་ཁྲི་འཕང་དུ་ཤིང་ཏ་ལ་བདུན་ཙམ་པ་སྲོག་ཆགས་བྱེ་བ་ཕྲག་མང་པོས་ཕྱག་བྱས་པ་མཐོང་ངམ།
en: “Brahmā,” answered the Blessed One, “do you see the billions of beings prostrating to the jeweled lion throne the height of seven palm trees on the central heart of that lotus, which is ten miles wide?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Blessed One, I do.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One then asked,

source: ཚངས་པ་ཁྱོད་ཀྱིས་སེང་གེའི་ཁྲི་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ། ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལེགས་པར་བརྒྱན་པ་འདུག་སྟེགང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མ་གཏོགས་པར་གཞན་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཟིལ་གྱིས་མནན་ནས་འདུག་པ། བྱང་ཆུབ་སེམས་དཔའ་མང་པོས་ཕྱག་བྱས་པ་མཐོང་ངམ།
en: “Brahmā, do you see the bodhisattva with the golden complexion on the lion throne—the one whose body is adorned with the major and minor marks of perfection, the one whose body outshines all the other bodhisattvas except for the body of the Thus-Gone One, the one who is being prostrated to by many bodhisattvas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚངས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ཞེས་བྱ་བ་སྟེ།
en: “Brahmā,” said the Blessed One, “he is called the bodhisattva great being Sāgaramati.

source: འདི་ནི་དེའི་རྣམ་པར་སྤྲུལ་པའོ། །
en: All of this is his manifestation.”

source: དེ་ནས་ཚངས་པ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ལ་ཕྱག་འཚལ་ནས་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Brahmā Great Compassionate One then prostrated to the bodhisattva great being Sāgaramati and exclaimed,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ཀྱང་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་འདི་ལྟ་བུ་དག་ཐོབ་པར་གྱུར་ཅིག །
en: “Blessed One, may all beings witness such miraculous wonders!

source: གང་དག་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོའི་མིང་ཐོས་པའི་སེམས་ཅན་དེ་དག་ནི་རྙེད་པ་ལེགས་པར་རྙེད་པ་ལགས་སོ། །
en: Any being who hears Bodhisattva Sāgaramati’s name definitely gains a great boon!

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་སྐྱེས་བུ་དམ་པ་འདིའི་མིང་ཐོས་ཤིང་གཟུགས་ཀྱི་ལུས་ཀྱང་མཐོང་བས་བདག་གིས་ཀྱང་རྙེད་པ་ལེགས་པར་རྙེད་དོ། །
en: Blessed One, even I have received a great boon in hearing the name of this sublime being and seeing his form.

source: བཅོམ་ལྡན་འདས་འདུས་པ་ཆེན་པོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡུན་ཇི་སྲིད་ཅིག་ཏུ་འཆད།
en: Blessed One, how long will that Dharma teaching, which is a section of the Great Compilation , be taught?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚངས་པ་ཇི་སྲིད་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་གནས་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆང་བ་དང་། ཀློག་པ་དང་། ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་དང་། རྒྱས་པར་བྱེད་ཀྱི་བར་དུའོ
en: “Brahmā,” responded the Blessed One, “for as long as the lifespan of the Thus-Gone One lasts, and even after the Thus-Gone One has passed into parinirvāṇa, for as long as these bodhisattvas uphold, recite, teach, and spread this Dharma teaching.

source: ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: ཚངས་པ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་འདིའི་ནང་དུ་འདུས་པའི་ཕྱིར་རོ། །
en: Because, Brahmā, the awakening of all the blessed buddhas of the past, present, and future is subsumed within this teaching.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོས་འཁོར་ཐམས་ཅད་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། ཚངས་པ་སྙིང་རྗེ་ཆེན་པོ་སེམས་པ་འདུན་པར་བྱ་བ་དང་། ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བརྒྱན་པར་བྱ་བ་དང་། བདགཉིད་ཀྱི་ཤེས་རབ་ཀྱི་དང་། སྤོབས་པའི་སྟོབས་ཉེ་བར་བསྟན་པའི་ཕྱིར་པད་མ་དང་ལྷན་ཅིག་སེང་གེའི་ཁྲི་དང་ལྷན་ཅིག་ཏུ་སྟེང་གི་བར་སྣང་ལ་ཤིང་ཏ་ལ་བདུན་སྲིད་ཙམ་ན་འདུག་སྟེདེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: The bodhisattva great being Sāgaramati then rose into the sky the height of seven palm trees upon his lotus and lion throne and spoke the following verses in order to bring extensive and genuine joy to the entire assembly, to arouse the interest of Brahmā Great Compassionate One, to ornament this Dharma teaching, and to demonstrate the power of his insight and eloquence:

source: ཁྲག་ཁྲིག་སངས་རྒྱས་ཞིང་རྡུལ་སྙེད་ཀྱི་ཞིང་རྣམས་འདས་པའི་འོག་ལོགས་ན། །རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་གནས་ཞིང་ཡོན་ཏན་ཀུན་ལྡན་རབ་མཛེས་པ། །
en: “Below, past as many realms as there are atoms in a billion buddha realms, Lives a perfected bodhisattva, replete with all qualities and beauty.

source: དེ་ན་འདྲེན་པའི་བསྟན་པ་རྒྱ་མཚོས་བློ་ཐུགས་མཚུངས་པ་མེད་བཞུགས་ཏེ། །
en: In his unequaled mind is found the ocean of the guides’ teachings.

source: དེར་ནི་བདག་གིས་ཐུབ་པའི་ཆོས་ཐོས་གྱུར་ཏེ་ཐོས་ནས་དེ་བཞིན་བཟུང་། །
en: From him I heard the Dharma of the sages and took it to heart.

source: བདག་ནི་སྟོབས་བཅུ་ལྡན་ལ་བལྟ་བར་བགྱི་དང་དེ་བཞིན་ཕྱག་བགྱི་དང་། །བྱང་ཆུབ་སེམས་དཔའ་ཁྱུ་མཆོག་འདི་རྣམས་ཕན་ཚུན་དྲི་སླད་འདིར་མཆིས་ཏེ
en: “We have come here to see the one with ten strengths, To venerate him, and to converse with the foremost bodhisattvas.”

source: སྐྱོབ་ལ་ཕྱག་བགྱི་བས་ནི་ཆོས་རྒྱལ་མཚུངས་མེད་ཁྱོད་ལ་འདིར་ཕྱག་འཚལ། །སངས་རྒྱས་མཆོད་པ་གང་ལགས་རྒྱ་ཆེན་ཤིན་ཏུ་རྒྱས་པས་མཆོད་པ་འཚལ། །
en: By venerating you, Protector, I prostrate to you, unequaled Dharma king, And offer to you effulgent and extensive veneration fit for a buddha.

source: གང་གིས་གཟུགས་ལ་གཟུགས་སུ་མི་རྟོག་ཚོར་བ་འདུས་བགྱིས་མ་ལགས་ཤིང་། །
en: “You do not conceptualize form as form, and for you, feeling is unconditioned.

source: རྣམ་པར་ཤེས་པའང་ཚོར་གསུམ་བཞིན་དུ་རྟག་པར་ཤིན་ཏུ་རྣམ་དག་སྟེ། །
en: Even consciousness is eternally pure during the three types of feeling.

source: གང་ཞིག་འདྲེན་ལ་མཚན་དུ་མ་ལགས་སྐྱེས་དང་རིགས་སུ་མ་ལགས་རྟོགས། །
en: You understand that being a leader is not about reputation, birth, or caste.

source: མིག་ལྡན་དེས་ནི་ཆོས་ཀྱི་རྒྱལ་པོ་དྲི་མེད་ཡང་དག་དོན་དུ་མཐོང་། །
en: Insightful Dharma king, you see what is immaculate and authentic.

source: བདག་གམ་བདག་མེད་ཅེས་བྱའི་མཐའ་དེ་གཉི་ག་མི་ལེན་མི་འདོར་ཏེ། །
en: “You neither take up nor avoid either extreme of self or nonself.

source: ནང་དུ་གྱུར་པ་ཞི་ཞིང་ཐུགས་ཀྱང་ཞི་སྟེ་ཕྱི་རོལ་རྒྱུ་མི་མངའ། །
en: You are inwardly peaceful, your mind is at peace, and you are not drawn outwardly.

source: མི་རྟོག་རྣམ་མི་རྟོག་ཅིང་རྟོག་བྲལ་ཐུབ་པའི་ཐུགས་ནི་ནམ་མཁའ་འདྲ། །
en: The Sage’s mind is like space: without thought, conceptuality, or mental processes.

source: དེས་ནི་ཕྱོགས་བཅུའི་བདེ་གཤེགས་ཆོས་ཀྱི་རྒྱལ་མཚན་གསལ་མཛད་རྣམས་ལ་མཆོད། །
en: I honor those who hoist the Dharma banner of the blissful ones in the ten directions.

source: གང་བློ་སྦྱིན་པ་རྣམས་ལ་འདི་ནི་སྒྱུ་མ་ལེན་པ་སྟོང་པ་ཉིད། །
en: “For you gifts are emptiness, like receiving an illusion.

source: གཡོ་བ་མེད་པའི་ཡིད་ཀྱིས་ནོར་རྣམས་དེ་དག་རེ་བ་མེད་པར་གཏོང་། །
en: With an unmoving mind, you give away treasures with no hope of return.

source: བྱང་ཆུབ་དོན་དུ་ངེས་ཀྱི་ལྟ་བར་ངེས་མིན་སྤྲོས་ལ་གནས་མ་ཡིན། །
en: For the sake of awakening your view is certain; you entertain no uncertain concepts.

source: གང་བློ་སེམས་ཅན་ཉེས་པ་མཐར་འབྱིན་དེ་ནི་སྦྱིན་བདག་སེར་སྣ་མེད། །
en: You are the donor free of stinginess who grants beings deliverance from their faults.

source: དེ་ནི་རབ་ཏུ་ཞི་བས་ཞི་སྟེ་ངག་མེད་ཡིད་མེད་ལུས་གདུང་མེད། །
en: “Having found peace, you are free from the torments of speech, mind, and body.

source: གདུང་བ་མེད་པས་བཅིང་བ་རྒྱ་ཆེན་བྲལ་ཏེ་དེས་པ་དབང་པོ་ཞི། །
en: Having no torments, you are freed from vast bondage and gentle, with peaceful faculties.

source: !བདག་མེད་ཐེག་པར་གནས་ནས་བྱང་ཆུབ་དམིགས་པ་མེད་ཅིང་དེ་མི་འདོར། །
en: With the knowledge of selflessness, you do not apprehend awakening, yet do not lose it.

source: ཁྲིམས་གནས་བློ་ལྡན་ཁྲིམས་འཆལ་མཐར་བྱེད་འདོད་པ་ཚུལ་ཁྲིམས་དྲི་མ་མེད། །
en: With discipline and insight, you wish to put an end to faulty discipline and remain pure in discipline.

source: ཆོས་རྣམས་སྐད་ཅིག་པར་ནི་རྟོགས་པར་ཤེས་བྱ་རྣམས་ལ་སྨྲས་པ་མེད། །
en: “Realizing the fleeting nature of things, there is nothing to say about objects of knowledge.

source: ནམ་མཁའ་མཚུངས་པའི་ཡིད་ཀྱིས་འགྲོ་བ་འདི་དག་སྒྱུ་མ་ཇི་བཞིན་མཐོང་། །
en: With your space-like mind you see all beings as illusions.

source: གང་ཞིག་ལུས་ནི་དུམ་བུ་དུམ་བུར་བཅད་ཀྱང་ཡིད་ནི་ཁྲོ་མི་འགྱུར། །
en: Even if your body were to be chopped into bits, it would arouse no anger.

source: གང་ཞིག་བྱང་ཆུབ་བརྟུལ་ཞུགས་གནས་པའི་བློ་ལྡན་མཁས་དེ་བཟོད་པ་སྨྲ། །
en: Learned one, maintaining the disciplined conduct of awakening, you advocate patience.

source: གང་ཞིག་ཆོས་རྣམས་ཆུ་ཟླ་ཆུ་བུར་མཉམ་ཞིང་སྒྱུ་མ་སྨིག་རྒྱུ་འདྲ། །རྟོགས་ནས་མི་མིན་སྲོག་མ་ཡིན་ཞིང་ཤེད་བུ་ལྡན་པ་མ་ཡིན་མཐོང་། །
en: “Realizing that phenomena are like water-moons, bubbles, illusions, and optical distortions, You see there is no person, life-force, or son of Manu.

source: བྱང་ཆུབ་དང་ནི་སེམས་ཅན་ཚོགས་མི་དམིགས་ཀྱང་བྱང་ཆུབ་གཞན་དོན་བརྩོན། །ཚུལ་འདིར་གང་ཞིག་སྐྲག་པ་མེད་པ་དེ་ནི་བརྩོན་འགྲུས་ཐ་མར་ཕྱིན། །
en: Without apprehending awakening or groups of beings you still seek awakening for others’ sake, And in this way you are fearless and take diligence to its farthest reaches.

source: གང་གི་སེམས་ནི་ཡུལ་ལ་ཆགས་པ་མེད་ཅིང་ཐེ་ཚོམ་ཡོད་མིན་ལ། །
en: “Your mind is not attached to objects and harbors no doubt.

source: སེམས་ཅན་གཞན་གྱི་སེམས་ཀྱི་སྤྱོད་པ་དུས་གསུམ་གྱུར་པའང་ཤེས་པ་དང་། །གང་སེམས་སྤྱོད་པར་གྱུར་པ་གང་ཡིན་དེ་
en: It knows the thoughts of other beings throughout the three times.

source: ཡི་བདུད་ཀྱིས་མི་ཤེས་པ། །
en: Your mind is unknown by the demon of the thinking mind.

source: ཕ་རོལ་ཕྱིན་ཐོབ་བསམ་གཏན་དང་ནི་མངོན་པར་ཤེས་ལ་བློ་གྲོས་གནས། །
en: Your intelligence is firmly grounded in the perfections, concentration, and super-knowledges.

source: གང་ཞིག་སངས་རྒྱས་རྣམས་ཀྱི་གསུང་ཀུན་ཉན་ཅིང་དེ་བཞིན་འཛིན་བྱེད་པ། །བསྐལ་པ་དཔག་ཏུ་མེད་པར་སྨྲས་ཀྱང་སྤོབས་པ་རྒྱུན་ཆད་མི་འགྱུར་ཏེ། །
en: “The eloquence of one who hears the buddhas’ speech and correctly upholds it Remains uninterrupted even if one speaks for fathomless eons.

source: སངས་རྒྱས་ཆོས་རྟོགས་སེམས་ཅན་མི་ལྟུང་དེ་ནི་གང་དུའང་གནས་མེད་པ། །
en: The one who attains buddha qualities without becoming a sentient being exists nowhere.

source: བཅོམ་ལྡན་ཐུབ་ཉིད་མཁྱེན་གཏེར་ཤེས་རབ་ལྡན་ཞིང་འཇིག་རྟེན་གསུམ་ན་དཔའ། །
en: With that insight—a treasure of the blessed sages’ wisdom—one is heroic in the three worlds.

source: གང་ཞིག་ཕ་རོལ་ཕྱིན་པའི་ཕ་རོལ་གཤེགས་ཀྱང་གཤེགས་མིན་མ་གཤེགས་མིན། །
en: “Whoever has gone to the other shore of the perfections has neither gone nor not gone.

source: གང་ཞིག་སེམས་ཅན་སྤྱོད་པ་མཐར་ཕྱིན་མི་གནས་གཡོ་བ་མི་མངའ་ཞིང་། །
en: Perfecting beings’ conduct, one is neither static nor moving.

source: ཡོན་ཏན་ཀུན་མཐར་གང་ཕྱིན་ཡོན་ཏན་རྣམས་ལ་རློམ་སེམས་མི་མངའ་བ། །
en: Perfecting all qualities, one harbors no arrogance about such qualities.

source: ཐུབ་པའི་དབང་པོ་ཤཱཀྱ་སངས་རྒྱས་ཁྱུ་མཆོག་དེ་ལ་མགོ་བོས་འཐུག །
en: One will bow to the foremost buddha of the Śākyas, the Lord of Sages.

source: འོད་ཟེར་རྣམ་དག་ཉི་མས་སྲིན་བུ་མེ་ཁྱེར་འོད་རྣམས་ཟིལ་གྱིས་མནན། །
en: “The pure radiance of the sun overwhelms the light cast by fireflies.

source: མེ་ལྕེ་རྩེ་མཐོན་བསྐལ་མཐའི་མེ་ཡིས་ས་ལ་ཇི་སྙེད་ཡོད་པ་སྲེག །
en: The tall flames at the end of an eon consume the entire earth.

source: རི་མཆོག་རི་རབ་ཀྱིས་ནི་ས་ལ་ཡོད་པའི་རི་ཀུན་ཟིལ་གྱིས་མནན། །
en: Mount Meru, the king of mountains, puts all other earthly mountains to shame.

source: ཤཱཀྱ་ཁྱུ་མཆོག་སྤུ་འདིས་འཇིག་རྟེན་གསུམ་གྱི་འོད་གཞན་ཟིལ་དུ་རླག །
en: A single hair of the leader of the Śākyas outshines any other light in the three worlds.

source: ཞིང་བརྒྱ་དག་ནས་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཁྱུ་མཆོག་ཇི་སྙེད་པ། །དེ་དག་གཙོ་བོ་ཁྱོད་ཀྱི་མདོག་དང་གཟི་བརྗིད་ཀྱིས་ནི་ཚིམ་པར་གྱུར། །
en: “Every bodhisattva leader who has come here from many different realms Is satisfied by your complexion and radiance, Lord.

source: གང་དག་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་ལྟར་ཀུན་གྱིས་འཐུན་པར་མཐོང་། །
en: Their perception accords with the aspirations they have made.

source: བདག་ཅག་གང་ནས་མ་འོངས་རང་གི་ཞིང་ཉིད་ན་ནི་འདུག་པར་ཤེས། །
en: We knew you were here in your field before we ever left our own.

source: ཇི་ལྟར་གང་གིས་རང་རིག་དེ་ལྟར་ཁྱོད་ཀྱི་གསུང་ནི་ཤིན་ཏུ་འཇུག །སྲིད་པ་གསུམ་ན་སྐད་རྣམས་ཇི་སྙེད་ཅི་མཆིས་དེ་དང་འཐུན་པར་འཇུག །
en: “Wherever beings perceive, there your speech reaches, Manifesting in all languages present throughout the three realms of existence.

source: རྡུལ་གྱི་རྡུལ་དང་མི་རྣམས་ཀྱི་ནི་སེམས་ཀྱི་བསམ་པ་བགྲང་ནུས་སྲིད། །ཐུབ་པའི་གསུང་དབྱངས་ཚད་མེད་ནམ་མཁའ་འདྲ་འདི་བགྲང་བར་ནུས་མ་ལགས། །
en: Atomic particles and the thoughts of humans could be counted, Yet the infinite utterances of the Sage’s voice, like space itself, defy quantification.

source: ནམ་མཁའི་མཐའ་དང་མི་རྣམས་ཀྱི་ནི་མཐའ་མ་བགྲང་བར་མི་ནུས་ཏེ། །འཁོར་བའི་སྔོན་གྱི་མཐའ་མ་ཉིད་ནི་རྣམ་པ་ཀུན་ཏུ་བགྲང་མི་ནུས། །
en: “The reaches of space and the extent of humans cannot be reckoned, And the extent of saṃsāra’s past is absolutely unfathomable.

source: ནམ་མཁའི་མཐའ་དང་འཁོར་བའི་མཐའ་ནི་མི་ཡིས་བགྲང་བར་ནུས་ཀྱང་སྲིད། །སངས་རྒྱས་མཁྱེན་དང་ཏིང་འཛིན་ཚུལ་ཁྲིམས་ཡུལ་ནི་གང་དུའང་ཤེས་མི་ནུས། །
en: Even if it were possible for somebody to quantify space or saṃsāra’s extent, They could never grasp the domain of the buddhas’ wisdom, absorption, and discipline.

source: གཞལ་ཡས་བསྐལ་པར་གང་གི་བསྔགས་པ་བརྗོད་པར་སླ་བ་མ་ལགས་པ། །
en: “Your praises would be difficult to express even in the course of countless eons.

source: ཁྱུ་མཆོག་དཔག་ཡས་ཆོས་ཀྱི་དབང་ཕྱུག་འདྲེན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: Guide, Lord of Dharma, immeasurable leader, to you we prostrate.

source: སྐྱེ་བོ་གང་དག་ཤེས་དང་མོས་པས་སངས་རྒྱས་ཆེ་བ་རྗེས་རྟོགས་པ། །
en: Beings realize the eminence of buddhas according to their understanding and inclinations.

source: དེ་དག་གིས་ནི་བློ་གྲོས་བསམ་ཡས་རྨད་བྱུང་ཀུན་ལྷག་འདྲེན་པ་མཐོང་། །
en: They will see the Guide as unfathomably intelligent, astonishing, and utterly superior.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་ནས་བར་སྣང་དེ་ལས་བབས་ཏེ།
en: When he had spoken these verses, the bodhisattva great being Sāgaramati descended from the sky.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms joined together, he bowed toward the Blessed One and said,

source: གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ། བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན།
en: “If I were to request a teaching, would the Blessed One honor my request?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: I have a few questions for the blessed, thus-gone, worthy, perfect buddha.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the bodhisattva great being Sāgaramati,

source: རིགས་ཀྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་།
en: “Noble son, you may ask the blessed, thus-gone, worthy, perfect Buddha whatever you like.

source: དྲིས་པ་དེ་དང་དེ་ངས་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: Then I will answer your questions and gladden your mind.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: So, the bodhisattva great being Sāgaramati said to the Blessed One,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ཤིན་ཏུ་དཀར་བ་དྲི་མ་མེད་པའི་ཕྱག་རྒྱ་ཞེས་བགྱི་བ་མཆིས་ཏེ།
en: “Blessed One, there is an absorption of the bodhisattva great beings called the pristine and immaculate seal .

source: ཏིང་ངེ་འཛིན་དེ་ལ་རབ་ཏུ་གནས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཞེས་བདག་གིས་ཐོས་ན།
en: I have heard that if bodhisattva great beings rest in this absorption, they will fully awaken to unsurpassed and perfect buddhahood.
